class AppServicesList {
  static List<String> conditionersServiceTypeList = [
    "تعبئة غاز و تنظيف مكيف",
    "نقل او تكريب مكيف",
    "تصليج مكيف",
  ];
  static List<String> conditionersServiceTypeIDList = [
    "2",
    "1",
    "3",
  ];
  static List<String> airConditioningTypeList = [
    "سبلت",
    "شباك",
    "مركزي",
  ];


  static List<String> regionList = [
    "الدوحة",
    "الوكرة",
    "الخور",
    "الريان",
    "ام صلال",
    "الغويرية",
    "الجميلية",
    "الشمال",
    "مسيعيد",
    "الشحانية",
  ];

  static List<String> executionTimeList = [
    "لأسبوع القادم",
    "خلال الأسبوع",
    "اليوم",
  ];

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  static List<String> electricityTypeList = [
    "نقل الاجهزة الكهربائية",
    "تمديد الاسلك",
    "اللوحات و القواطع",
    "الانارة و ملحقاتها",
    "المفاتيح و المقابس",
    "المراوح",
  ];
  static List<String> electricityTypeIDList = [
    "10",
    "4",
    "5",
    "6",
    "7",
    "9",
  ];

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  static List<String> plumbingServiceTypeList = [
    "المراحيض و الصرف الصحي",
    "انسداد و تسريبات",
    "حنفيات و خلاطات",
    "مغاسل و احواض",
    "احواض الاستحمام",
    "سخانات المياه",
    "مضخات المياه",
    "فلاتر المياه",
    "تمديد انابيب",
  ];
  static List<String> plumbingServiceTypeIDList = [
    "14",
    "11",
    "12",
    "13",
    "15",
    "16",
    "17",
    "18",
    "19",
  ];
  static List<String> residentialUnitList = [
    "فيلا",
    "شقة",
    "عمارة",
    "محل",
    "مكتب",
  ];

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

  static List<String> carServicesTypeList = [
    "الفرامل و العجلات الدوار",
    "زيت المحرك و الفلاتر",
    "اطارات",
    "البطارية",
    "المصابيح",
    "اعمال كهربائية",
    "فحص كامل",
    "صيانة كاملة",
  ];
  static List<String> carServicesTypeIDList = [
    "23",
    "21",
    "20",
    "22",
    "24",
    "25",
    "26",
    "27",
  ];
  static List<String> sparePartsList = [
    "موجود لدى العميل",
    "يجلبها مزود الخدمة",
  ];

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

  static List<String> carWashTypeList = [
    "داخلي و خارجي",
    "داخلي",
    "خارجي",
  ];
  static List<String> carWashTypeIDList = [
    "64",
    "62",
    "63",
  ];

  static List<String> polishTypeList = [
    "بولش داخلي و خارجي",
    "بولش داخلي",
    "بولش خارجي",
    "بدون بولش",
  ];

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

  static List<String> cleaningTypeList = [
    "خادمة منزلية",
    "تنظيف الستائر",
    "تنظيف السجائد",
  ];

  static List<String> cleaningTypeIDList = [
    "29",
    "30",
    "31",
  ];

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

  static List<String> hospitalityTypeList = [
    "البوفيهات و تقديم الطعام",
    "تقديم الشاه و القهوة",
    "تقديم العصائر و المشروبات",
  ];

  static List<String> hospitalityTypeIDList = [
    "32",
    "33",
    "34",
  ];

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

  static List<String> restaurantCartsTypeList = [
    "تقديم البرجر",
    "تقديم الباستا",
    "تقديم المشروبات",
  ];

  static List<String> restaurantCartsTypeIDList = [
    "35",
    "36",
    "37",
  ];

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

  static List<String> insecticidesTypeList = [
    "داخل و خارج المنزل",
    "داخل المنزل",
    "خارج المنزل",
  ];

  static List<String> insecticidesTypeIDList = [
    "40",
    "38",
    "39",
  ];

  static List<String> theTypeOfLocationRequiredList = [
    "حشرات",
    "قوارض",
    "زواحف",
  ];

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

  static List<String> coffeeAndSweetsCartsTypeList = [
    "تقديم القهوة و المشروبات",
    "تقديم الايسكريم و الحلويات",
    "تقديم الفشار",
    "تقديم الحلويات",
  ];

  static List<String> coffeeAndSweetsCartsTypeIDList = [
    "41",
    "42",
    "43",
    "44",
  ];

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

  static List<String> takePhotoTypeList = [
    "تصوير مناسبات",
    "تصوير فعاليات",
    "تصوير منتجات",
    "تصوير دعايات",
  ];
  static List<String> takePhotoTypeIDList = [
    "45",
    "46",
    "47",
    "48",
  ];

  static List<String> photographyTypeList = [
    "صور",
    "فيديو",
    "صور و فيديو",
  ];

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

  static List<String> printTypeList = [
    "طباعة اكواب و علب",
    "طباعة بزنس كارد",
    "طباعة اوراق و كتب",
    "طباعة اكياس",
  ];
  static List<String> printTypeIDList = [
    "50",
    "49",
    "51",
    "52",
  ];

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

  static List<String> organizingEventsTypeList = [
    "حفلات الاستقبال",
    "اعراس",
    "حفلات خطوبة",
  ];

  static List<String> organizingEventsTypeIDList = [
    "55",
    "53",
    "54",
  ];

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

  static List<String> partiesTypeList = [
    "أعياد الميلاد",
    "حفلات النجاح",
  ];

  static List<String> partiesTypeIDList = [
    "56",
    "57",
  ];

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  static List<String> connectingTypeList = [
    "توصيل طلبات",
  ];
  static List<String> connectingTypeIDList = [
    "58",
  ];
  static List<String> deliveryAreaTypeList = [
    "الدوحة",
    "الوكرة",
    "الخور",
    "الريان",
    "ام صلال",
    "الغويرية",
    "الجميلية",
    "الشمال",
    "مسيعيد",
    "الشحانية",
  ];

  /////////////////////////////////////////////////////////////////////////////////////////
  static List<String> countTypeList = [
    "1",
    "2",
    "3",
    "4",
    "5",
    "6",
    "7",
    "8",
    "9",
    "10",
    "11",
    "12",
    "13",
    "14",
    "15",
  ];
}
